qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_NXP/TARGET_LPC23XX/LPC23xx.h
/* mbed Microcontroller Library - LPC23xx CMSIS-like structs
 * Copyright (C) 2009 ARM Limited. All rights reserved.
 * 
 * An LPC23xx header file, based on the CMSIS LPC17xx.h and old LPC23xx.h
 */

#ifndef __LPC23xx_H
#define __LPC23xx_H

#ifdef __cplusplus
 extern "C" {
#endif 

/*
 * ==========================================================================
 * ---------- Interrupt Number Definition -----------------------------------
 * ==========================================================================
 */

typedef enum IRQn
{
/******  LPC23xx Specific Interrupt Numbers *******************************************************/
  WDT_IRQn                      = 0,        /*!< Watchdog Timer Interrupt                         */

  TIMER0_IRQn                   = 4,        /*!< Timer0 Interrupt                                 */
  TIMER1_IRQn                   = 5,        /*!< Timer1 Interrupt                                 */
  UART0_IRQn                    = 6,        /*!< UART0 Interrupt                                  */
  UART1_IRQn                    = 7,        /*!< UART1 Interrupt                                  */
  PWM1_IRQn                     = 8,        /*!< PWM1 Interrupt                                   */
  I2C0_IRQn                     = 9,        /*!< I2C0 Interrupt                                   */
  SPI_IRQn                      = 10,       /*!< SPI Interrupt                                    */
  SSP0_IRQn                     = 10,       /*!< SSP0 Interrupt                                   */
  SSP1_IRQn                     = 11,       /*!< SSP1 Interrupt                                   */
  PLL0_IRQn                     = 12,       /*!< PLL0 Lock (Main PLL) Interrupt                   */
  RTC_IRQn                      = 13,       /*!< Real Time Clock Interrupt                        */
  EINT0_IRQn                    = 14,       /*!< External Interrupt 0 Interrupt                   */
  EINT1_IRQn                    = 15,       /*!< External Interrupt 1 Interrupt                   */
  EINT2_IRQn                    = 16,       /*!< External Interrupt 2 Interrupt                   */
  EINT3_IRQn                    = 17,       /*!< External Interrupt 3 Interrupt                   */
  ADC_IRQn                      = 18,       /*!< A/D Converter Interrupt                          */
  I2C1_IRQn                     = 19,       /*!< I2C1 Interrupt                                   */
  BOD_IRQn                      = 20,       /*!< Brown-Out Detect Interrupt                       */
  ENET_IRQn                     = 21,       /*!< Ethernet Interrupt                               */
  USB_IRQn                      = 22,       /*!< USB Interrupt                                    */
  CAN_IRQn                      = 23,       /*!< CAN Interrupt                                    */
  MIC_IRQn                      = 24,       /*!< Multimedia Interface Controler                   */
  DMA_IRQn                      = 25,       /*!< General Purpose DMA Interrupt                    */
  TIMER2_IRQn                   = 26,       /*!< Timer2 Interrupt                                 */
  TIMER3_IRQn                   = 27,       /*!< Timer3 Interrupt                                 */
  UART2_IRQn                    = 28,       /*!< UART2 Interrupt                                  */
  UART3_IRQn                    = 29,       /*!< UART3 Interrupt                                  */
  I2C2_IRQn                     = 30,       /*!< I2C2 Interrupt                                   */
  I2S_IRQn                      = 31,       /*!< I2S Interrupt                                    */
} IRQn_Type;

/*
 * ==========================================================================
 * ----------- Processor and Core Peripheral Section ------------------------
 * ==========================================================================
 */

/* Configuration of the ARM7 Processor and Core Peripherals */
#define __MPU_PRESENT             0         /*!< MPU present or not                               */
#define __NVIC_PRIO_BITS          4         /*!< Number of Bits used for Priority Levels          */
#define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used     */


#include <core_arm7.h>
#include "system_LPC23xx.h"                 /* System Header                                      */


/******************************************************************************/
/*                Device Specific Peripheral registers structures             */
/******************************************************************************/
#if defined ( __CC_ARM   )
  #pragma anon_unions
#endif

/*------------- Vector Interupt Controler (VIC) ------------------------------*/
typedef struct
{
  __I  uint32_t IRQStatus;
  __I  uint32_t FIQStatus;
  __I  uint32_t RawIntr;
  __IO uint32_t IntSelect;
  __IO uint32_t IntEnable;
  __O  uint32_t IntEnClr;
  __IO uint32_t SoftInt;
  __O  uint32_t SoftIntClr;
  __IO uint32_t Protection;
  __IO uint32_t SWPriorityMask;
  __IO uint32_t RESERVED0[54];
  __IO uint32_t VectAddr[32];
  __IO uint32_t RESERVED1[32];
  __IO uint32_t VectPriority[32];
  __IO uint32_t RESERVED2[800];
  __IO uint32_t Address;
} LPC_VIC_TypeDef;

/*------------- System Control (SC) ------------------------------------------*/
typedef struct
{
  __IO uint32_t MAMCR;
  __IO uint32_t MAMTIM;
       uint32_t RESERVED0[14];
  __IO uint32_t MEMMAP;
       uint32_t RESERVED1[15];
  __IO uint32_t PLL0CON;                /* Clocking and Power Control         */
  __IO uint32_t PLL0CFG;
  __I  uint32_t PLL0STAT;
  __O  uint32_t PLL0FEED;
       uint32_t RESERVED2[12];
  __IO uint32_t PCON;
  __IO uint32_t PCONP;
       uint32_t RESERVED3[15];
  __IO uint32_t CCLKCFG;
  __IO uint32_t USBCLKCFG;
  __IO uint32_t CLKSRCSEL;
       uint32_t RESERVED4[12];
  __IO uint32_t EXTINT;                 /* External Interrupts                */
  __IO uint32_t INTWAKE;
  __IO uint32_t EXTMODE;
  __IO uint32_t EXTPOLAR;
       uint32_t RESERVED6[12];
  __IO uint32_t RSID;                   /* Reset                              */
  __IO uint32_t CSPR;
  __IO uint32_t AHBCFG1;
  __IO uint32_t AHBCFG2;
       uint32_t RESERVED7[4];
  __IO uint32_t SCS;                    /* Syscon Miscellaneous Registers     */
  __IO uint32_t IRCTRIM;                /* Clock Dividers                     */
  __IO uint32_t PCLKSEL0;
  __IO uint32_t PCLKSEL1;
       uint32_t RESERVED8[4];
  __IO uint32_t USBIntSt;               /* USB Device/OTG Interrupt Register  */
       uint32_t RESERVED9;
//  __IO uint32_t CLKOUTCFG;              /* Clock Output Configuration         */
 } LPC_SC_TypeDef;

