qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_NXP/TARGET_LPC23XX/LPC23xx.h
/*
#define FLASH_BASE            (0x00000000UL)
#define RAM_BASE              (0x10000000UL)
#define GPIO_BASE             (0x2009C000UL)
#define APB0_BASE             (0x40000000UL)
#define APB1_BASE             (0x40080000UL)
#define AHB_BASE              (0x50000000UL)
#define CM3_BASE              (0xE0000000UL)
*/

// TODO - #define VIC_BASE_ADDR	0xFFFFF000

#define LPC_WDT_BASE              (0xE0000000)
#define LPC_TIM0_BASE             (0xE0004000)
#define LPC_TIM1_BASE             (0xE0008000)
#define LPC_UART0_BASE            (0xE000C000)
#define LPC_UART1_BASE            (0xE0010000)
#define LPC_PWM1_BASE             (0xE0018000)
#define LPC_I2C0_BASE             (0xE001C000)
#define LPC_SPI_BASE              (0xE0020000)
#define LPC_RTC_BASE              (0xE0024000)
#define LPC_GPIOINT_BASE          (0xE0028080)
#define LPC_PINCON_BASE           (0xE002C000)
#define LPC_SSP1_BASE             (0xE0030000)
#define LPC_ADC_BASE              (0xE0034000)
#define LPC_CANAF_RAM_BASE        (0xE0038000)
#define LPC_CANAF_BASE            (0xE003C000)
#define LPC_CANCR_BASE            (0xE0040000)
#define LPC_CAN1_BASE             (0xE0044000)
#define LPC_CAN2_BASE             (0xE0048000)
#define LPC_I2C1_BASE             (0xE005C000)
#define LPC_SSP0_BASE             (0xE0068000)
#define LPC_DAC_BASE              (0xE006C000)
#define LPC_TIM2_BASE             (0xE0070000)
#define LPC_TIM3_BASE             (0xE0074000)
#define LPC_UART2_BASE            (0xE0078000)
#define LPC_UART3_BASE            (0xE007C000)
#define LPC_I2C2_BASE             (0xE0080000)
#define LPC_I2S_BASE              (0xE0088000)
#define LPC_MCI_BASE              (0xE008C000)
#define LPC_SC_BASE               (0xE01FC000)
#define LPC_EMAC_BASE             (0xFFE00000)
#define LPC_GPDMA_BASE            (0xFFE04000)
#define LPC_GPDMACH0_BASE         (0xFFE04100)
#define LPC_GPDMACH1_BASE         (0xFFE04120)
#define LPC_USB_BASE              (0xFFE0C000)
#define LPC_VIC_BASE              (0xFFFFF000)

/* GPIOs                                                                      */
#define LPC_GPIO0_BASE            (0x3FFFC000)
#define LPC_GPIO1_BASE            (0x3FFFC020)
#define LPC_GPIO2_BASE            (0x3FFFC040)
#define LPC_GPIO3_BASE            (0x3FFFC060)
#define LPC_GPIO4_BASE            (0x3FFFC080)


/******************************************************************************/
/*                         Peripheral declaration                             */
/******************************************************************************/
#define LPC_SC                    ((       LPC_SC_TypeDef *)        LPC_SC_BASE)
#define LPC_GPIO0                 ((     LPC_GPIO_TypeDef *)     LPC_GPIO0_BASE)
#define LPC_GPIO1                 ((     LPC_GPIO_TypeDef *)     LPC_GPIO1_BASE)
#define LPC_GPIO2                 ((     LPC_GPIO_TypeDef *)     LPC_GPIO2_BASE)
#define LPC_GPIO3                 ((     LPC_GPIO_TypeDef *)     LPC_GPIO3_BASE)
#define LPC_GPIO4                 ((     LPC_GPIO_TypeDef *)     LPC_GPIO4_BASE)
#define LPC_WDT                   ((      LPC_WDT_TypeDef *)       LPC_WDT_BASE)
#define LPC_TIM0                  ((      LPC_TIM_TypeDef *)      LPC_TIM0_BASE)
#define LPC_TIM1                  ((      LPC_TIM_TypeDef *)      LPC_TIM1_BASE)
#define LPC_TIM2                  ((      LPC_TIM_TypeDef *)      LPC_TIM2_BASE)
#define LPC_TIM3                  ((      LPC_TIM_TypeDef *)      LPC_TIM3_BASE)
#define LPC_UART0                 ((     LPC_UART_TypeDef *)     LPC_UART0_BASE)
#define LPC_UART1                 ((    LPC_UART1_TypeDef *)     LPC_UART1_BASE)
#define LPC_UART2                 ((     LPC_UART_TypeDef *)     LPC_UART2_BASE)
#define LPC_UART3                 ((     LPC_UART_TypeDef *)     LPC_UART3_BASE)
#define LPC_PWM1                  ((      LPC_PWM_TypeDef *)      LPC_PWM1_BASE)
#define LPC_I2C0                  ((      LPC_I2C_TypeDef *)      LPC_I2C0_BASE)
#define LPC_I2C1                  ((      LPC_I2C_TypeDef *)      LPC_I2C1_BASE)
#define LPC_I2C2                  ((      LPC_I2C_TypeDef *)      LPC_I2C2_BASE)
#define LPC_I2S                   ((      LPC_I2S_TypeDef *)       LPC_I2S_BASE)
#define LPC_SPI                   ((      LPC_SPI_TypeDef *)       LPC_SPI_BASE)
#define LPC_RTC                   ((      LPC_RTC_TypeDef *)       LPC_RTC_BASE)
#define LPC_GPIOINT               ((  LPC_GPIOINT_TypeDef *)   LPC_GPIOINT_BASE)
#define LPC_PINCON                ((   LPC_PINCON_TypeDef *)    LPC_PINCON_BASE)
#define LPC_SSP0                  ((      LPC_SSP_TypeDef *)      LPC_SSP0_BASE)
#define LPC_SSP1                  ((      LPC_SSP_TypeDef *)      LPC_SSP1_BASE)
#define LPC_ADC                   ((      LPC_ADC_TypeDef *)       LPC_ADC_BASE)
#define LPC_DAC                   ((      LPC_DAC_TypeDef *)       LPC_DAC_BASE)
#define LPC_CANAF_RAM             ((LPC_CANAF_RAM_TypeDef *) LPC_CANAF_RAM_BASE)
#define LPC_CANAF                 ((    LPC_CANAF_TypeDef *)     LPC_CANAF_BASE)
#define LPC_CANCR                 ((    LPC_CANCR_TypeDef *)     LPC_CANCR_BASE)
#define LPC_CAN1                  ((      LPC_CAN_TypeDef *)      LPC_CAN1_BASE)
#define LPC_CAN2                  ((      LPC_CAN_TypeDef *)      LPC_CAN2_BASE)
#define LPC_MCI                   ((      LPC_MCI_TypeDef *)       LPC_MCI_BASE)
#define LPC_EMAC                  ((     LPC_EMAC_TypeDef *)      LPC_EMAC_BASE)
#define LPC_GPDMA                 ((    LPC_GPDMA_TypeDef *)     LPC_GPDMA_BASE)
#define LPC_GPDMACH0              ((  LPC_GPDMACH_TypeDef *)  LPC_GPDMACH0_BASE)
#define LPC_GPDMACH1              ((  LPC_GPDMACH_TypeDef *)  LPC_GPDMACH1_BASE)
#define LPC_USB                   ((      LPC_USB_TypeDef *)       LPC_USB_BASE)
#define LPC_VIC                   ((      LPC_VIC_TypeDef *)       LPC_VIC_BASE)

#ifdef __cplusplus
 }
#endif 

#endif  // __LPC23xx_H

